app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC LIMIT ?  [["LIMIT", 5]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 2]]
---
    def index
        @produtos_por_nome = Produto.order(:nome).limit 5
        @produtos_por_preco = Produto.order(:preco).limit 2

SELECT "produtos".* FROM "produtos" WHERE (nome like '%teste%')
---
    def busca
    	@nome_a_buscar = params[:nome]
    	@produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"

INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Hertz Santos"], ["descricao", "Viado1"], ["quantidade", 1], ["preco", 1.0], ["created_at", "2019-09-03 21:32:33.534568"], ["updated_at", "2019-09-03 21:32:33.534568"]]
---
    def create
    	valores = params.require(:produto).permit :nome, :descricao, :quantidade, :preco
        produto = Produto.new valores
        if produto.save

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 12]]
---
    def destroy
    	id = params[:id]
    	Produto.destroy id